---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcTypeGuid
source: html/1fa48f46-c985-7c84-4e87-27cb7682207a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcTypeGuid Property

"Type IfcGUID"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcTypeGuid { get; }
```